<?php

/* Коды для замены букв */
$code = array(
    'а' => '1',
    'б' => '2',
    'в' => '3',
    'г' => '4',
    'д' => '5',
    'е' => '6',
    'ё' => '7',
    'ж' => '8',
    'з' => '9',
    'и' => '0',
    'й' => '#',
    'к' => 'a',
    'л' => 'b',
    'м' => 'c',
    'н' => 'd',
    'о' => 'e',
    'п' => 'f',
    'р' => 'g',
    'с' => 'h',
    'т' => 'j',
    'у' => 'k',
    'ф' => 'y',
    'х' => 'u',
    'ц' => 'i',
    'ч' => 'o',
    'ш' => 'p',
    'щ' => ';',
    'ъ' => 'l',
    'ы' => '[',
    'ь' => ']',
    'э' => 'z',
    'ю' => 'x',
    'я' => 'q',
);

$text = 'нас предали. явка провалена.';
$cipher = strtr($text, $code);

echo "Оригинал: $text\nШифровка: $cipher\n";
